GeneratedFiles/BasicHttpBinding_USCOREIGeocodeService.ReverseGeocode.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns4="http://dev.virtualearth.net/webservices/v1/common"
 xmlns:ns5="http://schemas.microsoft.com/2003/10/Serialization/"
 xmlns:ns7="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
 xmlns:ns1="http://s.mappoint.net/mappoint-30/"
 xmlns:ns10="http://dev.virtualearth.net/webservices/v1/geocode"
 xmlns:ns9="http://dev.virtualearth.net/webservices/v1/geocode/contracts"
 xmlns:ns13="http://dev.virtualearth.net/webservices/v1/imagery"
 xmlns:ns12="http://dev.virtualearth.net/webservices/v1/imagery/contracts"
 xmlns:ns16="http://dev.virtualearth.net/webservices/v1/route"
 xmlns:ns15="http://dev.virtualearth.net/webservices/v1/route/contracts"
 xmlns:ns6="http://dev.virtualearth.net/webservices/v1/search"
 xmlns:ns3="http://dev.virtualearth.net/webservices/v1/search/contracts">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns9:ReverseGeocode>
    <ns9:request>
     <ns10:Location>
      <ns4:Altitude>0.0</ns4:Altitude>
      <ns4:Latitude>0.0</ns4:Latitude>
      <ns4:Longitude>0.0</ns4:Longitude>
     </ns10:Location>
    </ns9:request>
   </ns9:ReverseGeocode>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
