NoteOnWebServiceCallTroubleShooting.txt

To isolate a SOAP service request:
Look for the service end point in tsh common.properties:
	iamap.services.geocode.endpoint=http://dev.virtualearth.net/webservices/v1/geocodeservice/geocodeservice.svc
	iamap.services.geocode.type=net.virtualearth.dev.webservices.v1.geocode.BasicHttpBinding_IGeocodeServiceStub
	
Enable log4j properties to debug on all apache packages.

Run tests.

From log pluck the request corresponding to the service defined in property file which is webservices/v1/geocodeservice/geocodeservice.svc

11:55:57.775 [HU-1493690156693] DEBUG [ScriptThread: DaAddRequest] HTTPSender - POST /webservices/v1/geocodeservice/geocodeservice.svc HTTP/1.0
	Content-Type: text/xml; charset=utf-8
	Accept: application/soap+xml, application/dime, multipart/related, text/*
	User-Agent: Axis/1.4
	Host: dev.virtualearth.net
	Cache-Control: no-cache
	Pragma: no-cache
	SOAPAction: "http://dev.virtualearth.net/webservices/v1/geocode/contracts/IGeocodeService/ReverseGeocode"
	Content-Length: 893

	<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ReverseGeocode xmlns="http://dev.virtualearth.net/webservices/v1/geocode/contracts"><request><ns1:Credentials xmlns:ns1="http://dev.virtualearth.net/webservices/v1/common"><ns1:ApplicationId>Aq1QPoKBKDlQiaWwyelP6cborOQhPIESPZWnP1HNk_bZ5c6BuGLamptciyuGD_-n</ns1:ApplicationId></ns1:Credentials><ns2:Location xmlns:ns2="http://dev.virtualearth.net/webservices/v1/geocode"><ns3:Latitude xmlns:ns3="http://dev.virtualearth.net/webservices/v1/common">-37.82582340432714</ns3:Latitude><ns4:Longitude xmlns:ns4="http://dev.virtualearth.net/webservices/v1/common">144.9987185975839</ns4:Longitude></ns2:Location></request></ReverseGeocode></soapenv:Body></soapenv:Envelope>

use telnet to send the http post request:
	telnet dev.virtualearth.net 80
	
